Break down M2 phase to sizable tasks
